[{"name":"Spring Framework","website":"https://spring.io/","comment":"Spring makes programming Java quicker, easier, and safer for everybody. Spring’s focus on speed, simplicity, and productivity has made it the world's most popular Java framework.","imageLink":"https://spring.io/images/spring-logo-fc4350c59999bb62c468361537212419.svg","tags":["Framework", "Java"]},
{"name":"Apache Maven","website":"https://maven.apache.org","comment":"Maven is a build automation tool used primarily for Java projects. Maven can also be used to build and manage projects written in C#, Ruby, Scala, and other languages. The Maven project is hosted by the Apache Software Foundation, where it was formerly part of the Jakarta Project","imageLink":"https://maven.apache.org/images/maven-logo-black-on-white.png","tags":["Build-automation", "Java"]},
{"name":"Linx","website":"https://linx.software/","comment":"Linx is a low code IDE and server. IT pros use Linx to quickly create custom automated business processes, integrate applications, expose web services and to efficiently handle high workloads.","imageLink":"https://www.guru99.com/images/1/linux_software_development_tool.png","tags":["IDE", "Server", "Web Services"]},
{"name":"Buddy","website":"https://buddy.works/","comment":"Buddy is a smart CI/CD tool for web developers designed to lower the entry threshold to DevOps. It uses delivery pipelines to build, test and deploy software. The pipelines are created with over 100 ready-to-use actions that can be arranged in any way – just like you build a house of bricks.","imageLink":"https://www.guru99.com/images/1/buddy_logo.png","tags":["Test", "Web", "DevOps"]},
{"name":"HeadSpin","website":"https://www.headspin.io/","comment":"HeadSpin is the world's first Connected Intelligence PlatformTM that provides Web, Mobile, IoT, and 5G solutions to unify testing, monitoring, and analytics across applications, devices, and networks. HeadSpin empowers development, QA, operations, and product teams to optimize connected experiences and ensure digital business success. ","imageLink":"https://www.guru99.com/images/1/headspin_logo.png","tags":["Web", "Testing", "Analytics"]},
{"name":"NetBeans","website":"https://netbeans.org/","comment":"NetBeans is a popular, Free, open-source IDE. It allows developing desktop, mobile and web applications. ","imageLink":"https://www.guru99.com/images/2-2017/092917_0411_Top20JavaTo2.png","tags":["IDE", "Java"]},
{"name":"Cloud9","website":"https://c9.io","comment":"Cloud9 IDE is an online integrated software development environment. It supports many programming languages like C, C++, PHP, Ruby, Perl, Python, JavaScript and Node.js.","imageLink":"https://www.guru99.com/images/2-2017/092917_0430_Top21Softwa1.png","tags":["PHP", "Ruby", "C++", "C", "IDE", "Perl", "Python", "JavaScript"]},
{"name":"Zend Studio","website":"https://www.zend.com/products/zend-studio","comment":"Zend Studio allows software developers to code faster, debug more easily. It is next-generation PHP IDE designed to create apps for boosting developers' productivity. It scales according to the DPI settings of the underlying operating system. ","imageLink":"https://www.guru99.com/images/2-2017/092917_0430_Top21Softwa2.png","tags":["IDE", "PHP"]},
{"name":"Atom","website":"https://atom.io/","comment":"Atom is a solid all-around text-editor. It is fully free and open source. It can be customized to do anything but without a need of modifying the config file. ","imageLink":"https://www.guru99.com/images/2-2017/092917_0430_Top21Softwa3.png","tags":["Text editor", "IDE"]},
{"name":"Spiralogics","website":"https://www.gotosaa.com/","comment":"Spiralogics Application Architecture (SAA) is a cloud-based software development tool. It allows users to build and customize their applications online and deploy them. It also allows users to choose from a set of prebuilt applications or customize them it from scratch. ","imageLink":"https://www.guru99.com/images/2-2017/092917_0430_Top21Softwa4.png","tags":["HTML", "Cloud", "DevOps"]},
{"name":"CodeLobster","website":"http://www.codelobster.com","comment":"Codelobster streamlines and simplifies PHP software development. process. It supports CMS like Wordpress, Drupal, Joomla, and Magento.","imageLink":"www.softfd.com/css/og-img/CodeLobster-PHP-Edition-logo.jpg","tags":["PHP", "HTML", "JavaScript", "CSS", "CMS", "IDE"]},
{"name":"Bootstrap","website":"https://getbootstrap.com/","comment":"Bootstrap is a responsive framework for developing with HTML, CSS, and JS. It has many in-builds components, which you can easily drag and drop to assemble responsive web pages.","imageLink":"https://www.guru99.com/images/2-2017/092917_0430_Top21Softwa7.png","tags":["CSS", "HTML", "JavaScript", "Framework"]},
{"name":"Azure","website":"https://azure.microsoft.com/en-in/","comment":"Microsoft Azure is widely used by developers to build, deploy and manage web applications. ","imageLink":"https://www.guru99.com/images/2-2017/092917_0430_Top21Softwa11.png","tags":["Web", "DevOps", "Server", "Cloud"]},
{"name":"Github","website":"https://github.com","comment":"GitHub allows developers to review code, manage projects, and build software. It offers right tool for different development jobs. ","imageLink":"https://www.guru99.com/images/2-2017/092917_0430_Top21Softwa12.png","tags":["Source Control"]},
{"name":"SendBird","website":"https://sendbird.com/","comment":"Sendbird is used as a messaging and Chat API for Mobile Apps and Websites. It offers scalability for a massive audience. It also prevents spam flooding of chat rooms.","imageLink":"https://www.guru99.com/images/2-2017/092917_0430_Top21Softwa17.png","tags":["API", "Mobile", "Web"]}]